files/HUAWIE_ONT_CHANGE.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:os="os.xsd.v1">
   <soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <wsse:UsernameToken wsu:Id="UsernameToken-2" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:Username>clarity</wsse:Username>
      <wsse:Password >Test1234#</wsse:Password>
    </wsse:UsernameToken>
  </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <os:MODIFY-ONT>
         <os:MODIFIER>ONT</os:MODIFIER>
         <os:object>
            <os:DEV>%ADSL_DNAME%</os:DEV>
            <os:FN>%HUW_FN%</os:FN>
            <os:SN>%HUW_SN%</os:SN>
            <os:PN>%HUW_PN%</os:PN>
            <os:ONTID>%HUW_VP%</os:ONTID>
         </os:object>
         <os:Session>1</os:Session>
         <os:objectParas>
            <os:SERIALNUM>%ONT_SN%</os:SERIALNUM>           
         </os:objectParas>
      </os:MODIFY-ONT>
   </soapenv:Body>
</soapenv:Envelope>